In [1]:
import numpy as np
import pandas as pd

In [4]:
my_df = pd.DataFrame(np.random.randn(4,5),[1,2,3,4],['red','orange','yellow','green','blue'])

In [5]:
my_df

        red    orange    yellow     green      blue
1 -0.135806  0.226589 -0.274963  0.243196 -1.489461
2  0.332181 -1.434841 -1.714449  1.832492  0.012610
3  0.064680 -0.038814  0.412432  2.138313  0.237872
4  1.327183  0.844997 -0.450377  0.549965  0.600588

In [7]:
my_df['orange'] # индексы строк из таблицы выше

1    0.226589
2   -1.434841
3   -0.038814
4    0.844997
Name: orange, dtype: float64

In [9]:
type(my_df['orange'])

pandas.core.series.Series

In [10]:
type(my_df)

pandas.core.frame.DataFrame

In [11]:
my_df[['yellow','blue']]

     yellow      blue
1 -0.274963 -1.489461
2 -1.714449  0.012610
3  0.412432  0.237872
4 -0.450377  0.600588

In [12]:
type(my_df[['yellow','blue']])

pandas.core.frame.DataFrame

In [13]:
my_df['indigo'] = my_df['blue']

In [14]:
my_df

        red    orange    yellow     green      blue    indigo
1 -0.135806  0.226589 -0.274963  0.243196 -1.489461 -1.489461
2  0.332181 -1.434841 -1.714449  1.832492  0.012610  0.012610
3  0.064680 -0.038814  0.412432  2.138313  0.237872  0.237872
4  1.327183  0.844997 -0.450377  0.549965  0.600588  0.600588

In [15]:
my_df['violet'] = my_df['blue'] + my_df['indigo']

In [16]:
my_df

        red    orange    yellow     green      blue    indigo    violet
1 -0.135806  0.226589 -0.274963  0.243196 -1.489461 -1.489461 -2.978922
2  0.332181 -1.434841 -1.714449  1.832492  0.012610  0.012610  0.025220
3  0.064680 -0.038814  0.412432  2.138313  0.237872  0.237872  0.475744
4  1.327183  0.844997 -0.450377  0.549965  0.600588  0.600588  1.201175

In [17]:
my_df.loc[1]  # получение строк таблицы выше

red      -0.135806
orange    0.226589
yellow   -0.274963
green     0.243196
blue     -1.489461
indigo   -1.489461
violet   -2.978922
Name: 1, dtype: float64

In [18]:
my_df.iloc[0] # iloc с нуля начинает считать

red      -0.135806
orange    0.226589
yellow   -0.274963
green     0.243196
blue     -1.489461
indigo   -1.489461
violet   -2.978922
Name: 1, dtype: float64

In [21]:
my_df.iloc[1] = my_df.loc[1]

In [22]:
my_df

        red    orange    yellow     green      blue    indigo    violet
1 -0.135806  0.226589 -0.274963  0.243196 -1.489461 -1.489461 -2.978922
2 -0.135806  0.226589 -0.274963  0.243196 -1.489461 -1.489461 -2.978922
3  0.064680 -0.038814  0.412432  2.138313  0.237872  0.237872  0.475744
4  1.327183  0.844997 -0.450377  0.549965  0.600588  0.600588  1.201175

In [25]:
my_df['orange'][3]

-0.03881413045017116

In [29]:
my_df.loc[[1,3],['blue','indigo']]

       blue    indigo
1 -1.489461 -1.489461
3  0.237872  0.237872

In [30]:
my_df.drop(3)  #верент новый DataFrame

        red    orange    yellow     green      blue    indigo    violet
1 -0.135806  0.226589 -0.274963  0.243196 -1.489461 -1.489461 -2.978922
2 -0.135806  0.226589 -0.274963  0.243196 -1.489461 -1.489461 -2.978922
4  1.327183  0.844997 -0.450377  0.549965  0.600588  0.600588  1.201175

In [31]:
my_df

        red    orange    yellow     green      blue    indigo    violet
1 -0.135806  0.226589 -0.274963  0.243196 -1.489461 -1.489461 -2.978922
2 -0.135806  0.226589 -0.274963  0.243196 -1.489461 -1.489461 -2.978922
3  0.064680 -0.038814  0.412432  2.138313  0.237872  0.237872  0.475744
4  1.327183  0.844997 -0.450377  0.549965  0.600588  0.600588  1.201175

In [33]:
my_df.drop(3,inplace = True)

In [34]:
my_df

        red    orange    yellow     green      blue    indigo    violet
1 -0.135806  0.226589 -0.274963  0.243196 -1.489461 -1.489461 -2.978922
2 -0.135806  0.226589 -0.274963  0.243196 -1.489461 -1.489461 -2.978922
4  1.327183  0.844997 -0.450377  0.549965  0.600588  0.600588  1.201175

In [35]:
my_df.drop('indigo',axis=1) #вернуть DataFrame без столбца

        red    orange    yellow     green      blue    violet
1 -0.135806  0.226589 -0.274963  0.243196 -1.489461 -2.978922
2 -0.135806  0.226589 -0.274963  0.243196 -1.489461 -2.978922
4  1.327183  0.844997 -0.450377  0.549965  0.600588  1.201175

In [37]:
my_df.drop('indigo',axis=1,inplace=True) #удалить из столбца

In [38]:
my_df

        red    orange    yellow     green      blue    violet
1 -0.135806  0.226589 -0.274963  0.243196 -1.489461 -2.978922
2 -0.135806  0.226589 -0.274963  0.243196 -1.489461 -2.978922
4  1.327183  0.844997 -0.450377  0.549965  0.600588  1.201175

In [39]:
my_df.shape #tuple для двумерной матрицы

(3, 6)